In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("D:\\ITI\\Python\\ITI_Python_for_Data_Management\\Extraction\\landing\\orders.csv")
df.head(10)

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id,Extraction_Date,source
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2,1.714563e+09,SQL-Server
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6,1.714563e+09,SQL-Server
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7,1.714563e+09,SQL-Server
3,4,175,4,2016-01-03,2016-01-04,2016-01-05,1,3,1.714563e+09,SQL-Server
4,5,1324,4,2016-01-03,2016-01-06,2016-01-06,2,6,1.714563e+09,SQL-Server
5,6,94,4,2016-01-04,2016-01-07,2016-01-05,2,6,1.714563e+09,SQL-Server
6,7,324,4,2016-01-04,2016-01-07,2016-01-05,2,6,1.714563e+09,SQL-Server
7,8,1204,4,2016-01-04,2016-01-05,2016-01-05,2,7,1.714563e+09,SQL-Server
8,9,60,4,2016-01-05,2016-01-08,2016-01-08,1,2,1.714563e+09,SQL-Server
9,10,442,4,2016-01-05,2016-01-06,2016-01-06,2,6,1.714563e+09,SQL-Server

# Data Cleaning

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1445 entries, 0 to 1444
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         1445 non-null   int64
 1   customer_id      1445 non-null   int64
 2   order_status     1445 non-null   int64
 3   order_date       1445 non-null   object
 4   required_date    1445 non-null   object
 5   shipped_date     1445 non-null   object
 6   store_id         1445 non-null   int64
 7   staff_id         1445 non-null   int64
 8   Extraction_Date  1445 non-null   float64
 9   source           1445 non-null   object
dtypes: float64(1), int64(5), object(4)
memory usage: 113.0+ KB

In [4]:
# convert order_date, required_date, and shipped_date into datetime
df['order_date'] = pd.to_datetime(df['order_date'])
df['required_date'] = pd.to_datetime(df['required_date'])
df['shipped_date'] = pd.to_datetime(df['shipped_date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1445 entries, 0 to 1444
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         1445 non-null   int64
 1   customer_id      1445 non-null   int64
 2   order_status     1445 non-null   int64
 3   order_date       1445 non-null   datetime64[ns]
 4   required_date    1445 non-null   datetime64[ns]
 5   shipped_date     1445 non-null   datetime64[ns]
 6   store_id         1445 non-null   int64
 7   staff_id         1445 non-null   int64
 8   Extraction_Date  1445 non-null   float64
 9   source           1445 non-null   object
dtypes: datetime64[ns](3), float64(1), int64(5), object(1)
memory usage: 113.0+ KB

In [5]:
df.shape

(1445, 10)

In [6]:
filtered_df = df[(df['order_date'].dt.year >= 2000) & (df['order_date'].dt.year <= 2024)]
filtered_df.shape

(1445, 10)

In [9]:
# check for Missing data
filtered_df.isna().sum()

order_id           0
customer_id        0
order_status       0
order_date         0
required_date      0
shipped_date       0
store_id           0
staff_id           0
Extraction_Date    0
source             0
dtype: int64

In [10]:
# check for duplicates
filtered_df.duplicated().sum()

0

In [11]:
filtered_df['Extraction_Date'] = pd.to_datetime(filtered_df['Extraction_Date'], unit='s')
filtered_df.head()

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id,Extraction_Date,source
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2,2024-05-01 11:37:28.021257401,SQL-Server
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6,2024-05-01 11:37:28.021257401,SQL-Server
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7,2024-05-01 11:37:28.021257401,SQL-Server
3,4,175,4,2016-01-03,2016-01-04,2016-01-05,1,3,2024-05-01 11:37:28.021257401,SQL-Server
4,5,1324,4,2016-01-03,2016-01-06,2016-01-06,2,6,2024-05-01 11:37:28.021257401,SQL-Server

In [12]:
filtered_df.to_csv("D:\\ITI\\Python\\ITI_Python_for_Data_Management\\Extraction\\Staging\\orders\\orders.csv")